app/views/posts/_comment.html.erb

INSERT INTO `comments` (`text`, `updated_at`, `user_id`, `created_at`, `post_id`) VALUES ('ывпывп', '2012-02-25 10:21:46', 7, '2012-02-25 10:21:46', NULL)
---
  <%= comment.user.nickname %>
  (<%= comment.created_at.to_s(:long) %>)