app/views/posts/index.html.erb

SELECT COUNT(*) FROM `comments` WHERE (`comments`.post_id = 2)
---
      <small>
        <%= post.comments.count %>&nbsp;comments.
      </small>