app/controllers/comments_controller.rb

  def index
    @comments = Comment.all(:order => "created_at DESC")
---
SELECT `comments`.* FROM `comments` ORDER BY created_at DESC

  def edit
    @comment = Comment.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 19 LIMIT 1

  def create
    params[:comment][:post_id] = params[:post_id]
    params[:comment][:user_id] = session[:user_id]
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`updated_at`, `user_id`, `post_id`, `created_at`, `text`) VALUES ('2012-02-25 09:32:41', NULL, NULL, '2012-02-25 09:32:41', 'qwe')

  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 19 LIMIT 1
UPDATE `comments` SET `text` = '123123', `updated_at` = '2012-02-26 10:22:00' WHERE `comments`.`id` = 19