app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`text`, `updated_at`, `title`, `description`, `created_at`) VALUES ('Знаменитая певица и актриса стала почетным гостем пивной компании, лицом которой она является на красочном празднике в Бразилии.\r\n\r\n\r\nДжей Ло наслаждалась карнавалом в Рио вместе с бойфрендом (фото AP)\r\n\r\nЛатиноамериканская красавица артистка Дженнифер Лопес стала почетной гостьей на знаменитом карнавале в Рио-де-Жанейро в Бразилии в минувшее воскресенье.\r\n\r\nНесмотря на то что звезда не принимала участия в соревнованиях самых лучших танцевальных школ самбы, Джей Ло все равно привлекла внимание публики одним своим появлением на VIP-трибуне, откуда она наблюдала за красочным действием вместе со своим бойфрендом Каспером Смартом.\r\n\r\n42-летняя актриса и певица была приглашена на карнавал в рамках рекламной акции бразильской пивной компании, лицом которой является.\r\n\r\nТакже на параде была замечена поп-дива Ферги, которая представляла марку известного шампуня.\r\n\r\nЗнаменитости ежегодно посещают карнавал в Рио. В предыдущие годы на празднике присутствовали Мадонна, Бейонсе, Джуд Лоу, Пэрис Хилтон и Памэла Андерсон.', '2012-02-26 15:10:42', 'Дженнифер Лопес посетила карнавал в Рио', 'Знаменитая певица и актриса стала почетным гостем пивной компании, лицом которой она является на красочном празднике в Бразилии.', '2012-02-26 15:10:42')

  def update
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1