app/controllers/users_controller.rb

INSERT INTO `users` (`password`, `is_admin`, `updated_at`, `created_at`, `nickname`, `email`) VALUES ('234234', NULL, '2012-02-18 14:49:22', '2012-02-18 14:49:22', '123', '123')
---
  def create
    @user = User.new(params[:user])
    @user.is_admin = false
    if @user.valid?
      @user.save

SELECT `users`.* FROM `users` WHERE (nickname = '123' AND password = '123') LIMIT 1
---
  def login
    @user = User.new
    if request.post?
      user = User.where("nickname = ? AND password = ?", params[:user][:nickname], params[:user][:password]).first

INSERT INTO `users` (`is_admin`, `email`, `password`, `nickname`, `created_at`, `updated_at`) VALUES (0, 'EnglandPost@gmail.com', '123', 'englandposted', '2012-02-19 10:51:17', '2012-02-19 10:51:17')
---
  def register
    @user = User.new
    if request.post?
      @user = User.new(params[:user])
      @user.is_admin = false
      if @user.valid?
        @user.save